Autodesk.Revit.DB.Structure.ReinforcementSettings.DocumentContainsNoRebar
Checks whether the document is free of Rebar elements.
Only in this case it is allowed to change RebarShapeDefinesHooks property.
Since:
2013

Autodesk.Revit.DB.Structure.ReinforcementSettings.DocumentContainsNoAreaOrPathReinforcement
Checks whether the document is free of AreaReinforcement and PathReinforcement
elements. Only in this case is it permissible to change the
HostStructuralRebar property.
Only in this case it is allowed to change RebarShapeDefinesHooks property.
Since:
2013

Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarShapeDefinesHooks
Hooks are defined by Rebar Shape of Rebar element. Can be changed if document contains no rebars, area reinforcements and path reinforcements.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the document contains one or more Rebar elements.
-or-
When setting this property: the document contains one or more AreaReinforcement or PathReinforcement
elements.
Since:
2014

Autodesk.Revit.DB.Structure.ReinforcementSettings.HostStructuralRebar
Host Structural Rebar within Area and Path Reinforcement with touching AtomHostStructuralRebar.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: the document contains one or more AreaReinforcement or PathReinforcement
elements.
Since:
2013